nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/driver_examples/pwm/pin_mux.c
/*
 * Copyright 2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v12.0
processor: MC56F80748
package_id: MC56F80748VLH
mcu_data: ksdk2_0
processor_version: 0.12.7
board: MC56F80000-EVK
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_sim.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '7', peripheral: QSCI0, signal: RXD, pin_signal: GPIOC3/TA0/CMPA_O/RXD0/CLKIN1}
  - {pin_num: '5', peripheral: QSCI0, signal: TXD, pin_signal: GPIOC2/TXD0/XB_OUT11/XB_IN2/CLKO0}
  - {pin_num: '3', peripheral: OCCS, signal: EXTAL, pin_signal: GPIOC0/EXTAL/CLKIN0}
  - {pin_num: '4', peripheral: OCCS, signal: XTAL, pin_signal: GPIOC1/XTAL}
  - {pin_num: '45', peripheral: PWMA, signal: 'B, 0', pin_signal: GPIOE0/PWMA_0B/XB_OUT4}
  - {pin_num: '46', peripheral: PWMA, signal: 'A, 0', pin_signal: GPIOE1/PWMA_0A/XB_OUT5}
  - {pin_num: '48', peripheral: PWMA, signal: 'A, 1', pin_signal: GPIOE3/PWMA_1A/XB_OUT7}
  - {pin_num: '52', peripheral: PWMA, signal: 'A, 2', pin_signal: GPIOE5/PWMA_2A/XB_IN3/XB_OUT9}
  - {pin_num: '41', peripheral: PWMA, signal: 'FAULT, 6', pin_signal: GPIOF4/TXD1/XB_OUT8/PWMA_0X/PWMA_FAULT6}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIOE IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOE);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* Enable peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMode(BOARD_EXTAL_GPIO, BOARD_EXTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C0_EXTAL);
    /* Enable peripheral functionality on pin GPIOC1 (pin 4) */
    GPIO_PinSetPeripheralMode(BOARD_XTAL_GPIO, BOARD_XTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOC2 (pin 5) */
    GPIO_PinSetPeripheralMode(BOARD_Boot_TXD0_GPIO, BOARD_Boot_TXD0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC2 (pin 5) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C2_TXD0);
    /* Enable peripheral functionality on pin GPIOC3 (pin 7) */
    GPIO_PinSetPeripheralMode(BOARD_Boot_RXD0_GPIO, BOARD_Boot_RXD0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC3 (pin 7) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C3_RXD0);
    /* Enable peripheral functionality on pin GPIOE0 (pin 45) */
    GPIO_PinSetPeripheralMode(BOARD_LED0_GPIO, BOARD_LED0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE0 (pin 45) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E0_PWMA_0B);
    /* Enable peripheral functionality on pin GPIOE1 (pin 46) */
    GPIO_PinSetPeripheralMode(BOARD_LED1_GPIO, BOARD_LED1_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE1 (pin 46) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E1_PWMA_0A);
    /* Enable peripheral functionality on pin GPIOE3 (pin 48) */
    GPIO_PinSetPeripheralMode(BOARD_LED3_GPIO, BOARD_LED3_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE3 (pin 48) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E3_PWMA_1A);
    /* Enable peripheral functionality on pin GPIOE5 (pin 52) */
    GPIO_PinSetPeripheralMode(BOARD_LED5_GPIO, BOARD_LED5_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE5 (pin 52) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E5_PWMA_2A);
    /* Enable peripheral functionality on pin GPIOF4 (pin 41) */
    GPIO_PinSetPeripheralMode(BOARD_LED_BLUE_GPIO, BOARD_LED_BLUE_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF4 (pin 41) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F4_PWMA_FAULT6);

    /* Internal Peripheral Select */
    /* Select SCI0_RXD Input.: Select SCI0_RXD Input, GPIOC3 or GPIOC8 or GPIOF8. */
    SIM_SetInternalPeriInput(SIM, kSIM_SCI0_RXDInputIndex, kSIM_SCI0_RXDInput_GPIOC3_GPIOC8_GPIOF8);

}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
